Revit 2027 API
RebarShape.RebarStyle Property
 Whether the shape represents a standard bar or a stirrup.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarStyle RebarStyle { get; }
Public ReadOnly Property RebarStyle As RebarStyle
	Get
public:
property RebarStyle RebarStyle {
	RebarStyle get ();
}
member RebarStyle : RebarStyle with get
Property Value
RebarStyle
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace